book/md/OpenIdProject.org.html
<!DOCTYPE HTML>
<html lang="en" class="light" dir="ltr">
    <head>
        <!-- Book generated using mdBook -->
        <meta charset="UTF-8">
        <title>OpenIdProject.org.md - posts</title>


        <!-- Custom HTML head -->
        
        <meta name="description" content="">
        <meta name="viewport" content="width=device-width, initial-scale=1">
        <meta name="theme-color" content="#ffffff">

        <link rel="icon" href="../favicon.svg">
        <link rel="shortcut icon" href="../favicon.png">
        <link rel="stylesheet" href="../css/variables.css">
        <link rel="stylesheet" href="../css/general.css">
        <link rel="stylesheet" href="../css/chrome.css">
        <link rel="stylesheet" href="../css/print.css" media="print">

        <!-- Fonts -->
        <link rel="stylesheet" href="../FontAwesome/css/font-awesome.css">
        <link rel="stylesheet" href="../fonts/fonts.css">

        <!-- Highlight.js Stylesheets -->
        <link rel="stylesheet" href="../highlight.css">
        <link rel="stylesheet" href="../tomorrow-night.css">
        <link rel="stylesheet" href="../ayu-highlight.css">

        <!-- Custom theme stylesheets -->

        <!-- MathJax -->
    </head>
    <body class="sidebar-visible no-js">
    <div id="body-container">
        <!-- Provide site root to javascript -->
        <script>
            var path_to_root = "../";
            var default_theme = window.matchMedia("(prefers-color-scheme: dark)").matches ? "navy" : "light";
        </script>

        <!-- Work around some values being stored in localStorage wrapped in quotes -->
        <script>
            try {
                var theme = localStorage.getItem('mdbook-theme');
                var sidebar = localStorage.getItem('mdbook-sidebar');

                if (theme.startsWith('"') && theme.endsWith('"')) {
                    localStorage.setItem('mdbook-theme', theme.slice(1, theme.length - 1));
                }

                if (sidebar.startsWith('"') && sidebar.endsWith('"')) {
                    localStorage.setItem('mdbook-sidebar', sidebar.slice(1, sidebar.length - 1));
                }
            } catch (e) { }
        </script>

        <!-- Set the theme before any content is loaded, prevents flash -->
        <script>
            var theme;
            try { theme = localStorage.getItem('mdbook-theme'); } catch(e) { }
            if (theme === null || theme === undefined) { theme = default_theme; }
            var html = document.querySelector('html');
            html.classList.remove('light')
            html.classList.add(theme);
            var body = document.querySelector('body');
            body.classList.remove('no-js')
            body.classList.add('js');
        </script>

        <input type="checkbox" id="sidebar-toggle-anchor" class="hidden">

        <!-- Hide / unhide sidebar before it is displayed -->
        <script>
            var body = document.querySelector('body');
            var sidebar = null;
            var sidebar_toggle = document.getElementById("sidebar-toggle-anchor");
            if (document.body.clientWidth >= 1080) {
                try { sidebar = localStorage.getItem('mdbook-sidebar'); } catch(e) { }
                sidebar = sidebar || 'visible';
            } else {
                sidebar = 'hidden';
            }
            sidebar_toggle.checked = sidebar === 'visible';
            body.classList.remove('sidebar-visible');
            body.classList.add("sidebar-" + sidebar);
        </script>

        <nav id="sidebar" class="sidebar" aria-label="Table of contents">
            <div class="sidebar-scrollbox">
                <ol class="chapter"><li class="chapter-item expanded "><a href="../md/Association_Rule_minning.org.html"><strong aria-hidden="true">1.</strong> Association_Rule_minning.org.md</a></li><li class="chapter-item expanded "><a href="../md/BinaryHeap2FibonacciHeap.org.html"><strong aria-hidden="true">2.</strong> BinaryHeap2FibonacciHeap.org.md</a></li><li class="chapter-item expanded "><a href="../md/Colab_hotkey.org.html"><strong aria-hidden="true">3.</strong> Colab_hotkey.org.md</a></li><li class="chapter-item expanded "><a href="../md/disable_device.org.html"><strong aria-hidden="true">4.</strong> disable_device.org.md</a></li><li class="chapter-item expanded "><a href="../md/MasterTheorem.org.html"><strong aria-hidden="true">5.</strong> MasterTheorem.org.md</a></li><li class="chapter-item expanded "><a href="../md/OpenIdProject.org.html" class="active"><strong aria-hidden="true">6.</strong> OpenIdProject.org.md</a></li><li class="chapter-item expanded "><a href="../md/Pandas_merge.org.html"><strong aria-hidden="true">7.</strong> Pandas_merge.org.md</a></li><li class="chapter-item expanded "><a href="../md/PythonWith~.org.html"><strong aria-hidden="true">8.</strong> PythonWith~.org.md</a></li><li class="chapter-item expanded "><a href="../md/UniversalHashing.org.html"><strong aria-hidden="true">9.</strong> UniversalHashing.org.md</a></li><li class="chapter-item expanded "><a href="../md/uwsgi_deploy.org.html"><strong aria-hidden="true">10.</strong> uwsgi_deploy.org.md</a></li><li class="chapter-item expanded "><a href="../md/yarnInstall.org.html"><strong aria-hidden="true">11.</strong> yarnInstall.org.md</a></li><li class="chapter-item expanded "><a href="../md/受难记.org.html"><strong aria-hidden="true">12.</strong> 受难记.org.md</a></li></ol>
            </div>
            <div id="sidebar-resize-handle" class="sidebar-resize-handle">
                <div class="sidebar-resize-indicator"></div>
            </div>
        </nav>

        <!-- Track and set sidebar scroll position -->
        <script>
            var sidebarScrollbox = document.querySelector('#sidebar .sidebar-scrollbox');
            sidebarScrollbox.addEventListener('click', function(e) {
                if (e.target.tagName === 'A') {
                    sessionStorage.setItem('sidebar-scroll', sidebarScrollbox.scrollTop);
                }
            }, { passive: true });
            var sidebarScrollTop = sessionStorage.getItem('sidebar-scroll');
            sessionStorage.removeItem('sidebar-scroll');
            if (sidebarScrollTop) {
                // preserve sidebar scroll position when navigating via links within sidebar
                sidebarScrollbox.scrollTop = sidebarScrollTop;
            } else {
                // scroll sidebar to current active section when navigating via "next/previous chapter" buttons
                var activeSection = document.querySelector('#sidebar .active');
                if (activeSection) {
                    activeSection.scrollIntoView({ block: 'center' });
                }
            }
        </script>

        <div id="page-wrapper" class="page-wrapper">

            <div class="page">
                                <div id="menu-bar-hover-placeholder"></div>
                <div id="menu-bar" class="menu-bar sticky">
                    <div class="left-buttons">
                        <label id="sidebar-toggle" class="icon-button" for="sidebar-toggle-anchor" title="Toggle Table of Contents" aria-label="Toggle Table of Contents" aria-controls="sidebar">
                            <i class="fa fa-bars"></i>
                        </label>
                        <button id="theme-toggle" class="icon-button" type="button" title="Change theme" aria-label="Change theme" aria-haspopup="true" aria-expanded="false" aria-controls="theme-list">
                            <i class="fa fa-paint-brush"></i>
                        </button>
                        <ul id="theme-list" class="theme-popup" aria-label="Themes" role="menu">
                            <li role="none"><button role="menuitem" class="theme" id="light">Light</button></li>
                            <li role="none"><button role="menuitem" class="theme" id="rust">Rust</button></li>
                            <li role="none"><button role="menuitem" class="theme" id="coal">Coal</button></li>
                            <li role="none"><button role="menuitem" class="theme" id="navy">Navy</button></li>
                            <li role="none"><button role="menuitem" class="theme" id="ayu">Ayu</button></li>
                        </ul>
                        <button id="search-toggle" class="icon-button" type="button" title="Search. (Shortkey: s)" aria-label="Toggle Searchbar" aria-expanded="false" aria-keyshortcuts="S" aria-controls="searchbar">
                            <i class="fa fa-search"></i>
                        </button>
                    </div>

                    <h1 class="menu-title">posts</h1>

                    <div class="right-buttons">
                        <a href="../print.html" title="Print this book" aria-label="Print this book">
                            <i id="print-button" class="fa fa-print"></i>
                        </a>

                    </div>
                </div>

                <div id="search-wrapper" class="hidden">
                    <form id="searchbar-outer" class="searchbar-outer">
                        <input type="search" id="searchbar" name="searchbar" placeholder="Search this book ..." aria-controls="searchresults-outer" aria-describedby="searchresults-header">
                    </form>
                    <div id="searchresults-outer" class="searchresults-outer hidden">
                        <div id="searchresults-header" class="searchresults-header"></div>
                        <ul id="searchresults">
                        </ul>
                    </div>
                </div>

                <!-- Apply ARIA attributes after the sidebar and the sidebar toggle button are added to the DOM -->
                <script>
                    document.getElementById('sidebar-toggle').setAttribute('aria-expanded', sidebar === 'visible');
                    document.getElementById('sidebar').setAttribute('aria-hidden', sidebar !== 'visible');
                    Array.from(document.querySelectorAll('#sidebar a')).forEach(function(link) {
                        link.setAttribute('tabIndex', sidebar === 'visible' ? 0 : -1);
                    });
                </script>

                <div id="content" class="content">
                    <main>
                        <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.16.4/dist/katex.min.css">
<hr />
<h2>author: Silin Zhao
title: OpenIdProject</h2>
<pre><code class="language-{=org}">#+STARTUP: overview
</code></pre>
<h1 id="project-description"><a class="header" href="#project-description">Project description</a></h1>
<p>OpenIdProject is a open identification oriented project, and based on
block chain technology, social network Application. The key part is
keeping all information which are relate to the owner, and tracing each
those information back to when it occured. At the same time each
propagation of those information will be cross valided its exisence.
This project is offical started now (Wed Aug 3 22:41:29 2022), but its
desige has been start about 2018. I will start to describe its content
as following parting.</p>
<h1 id="what-will-be-noted"><a class="header" href="#what-will-be-noted">What will be noted</a></h1>
<h2 id="was-is-valuable-for-us"><a class="header" href="#was-is-valuable-for-us">Was is valuable for us</a></h2>
<p>Information is the only valuable matter, according to my personal
opinion. irony, it's invisible. From deep aspect, information is just
one porperties of visible matter, one of permutations of atoms. so if
people change the permutation, the corresponding information is lost.</p>
<p>According to the desige of the project, all information, which has been
recorded with this application should be able to be proofed with aspect
to its exisence.</p>
<p>With the development of our social state, information access is getting
more faster, but its purity and ownership is not get guaranteed. But for
a referencing, the purity and ownership of information should be so
important as information itself. Those are valuable for us.</p>
<p>Here I list some information which can be as a example for our project.</p>
<h3 id="personal-information"><a class="header" href="#personal-information">Personal Information</a></h3>
<p>In our society each of us should already has a identification, it can
even be referenced to personal DNA serial. But now, our personal
information is separated in different parts, health records, educational
background, work experience... In the near further, I believe we should
easily be able to get known such information.</p>
<h3 id="original-work-of-copy-right"><a class="header" href="#original-work-of-copy-right">original work of copy right</a></h3>
<p>creative ideas, digital artistic product, literary and artistic
creative... any of such things, should be labeled from its creator. All
such records will be embeded into personal block chain with timestamp
and ownership detail information. Copy right problem for digital product
can be solved with this project.</p>
<h3 id="smartcontract"><a class="header" href="#smartcontract">Smartcontract</a></h3>
<p>basically, all smartcontract involved can be referenced also here,
seeing later update</p>
<h3 id="records-into-block-chain"><a class="header" href="#records-into-block-chain">Records into block chain</a></h3>
<p>Each records has unified hashtag. Even only one letter has been changed,
its unified hashtag will be changed totally. This hashtag can only proof
that, the original records has occured at its timestamp. Important, the
recorded itself will NOT be embeded into block chain, only its hashtag.
so if someone what to proof the exisence of one record, this person has
to have the record.</p>
<h3 id="sensitive-information"><a class="header" href="#sensitive-information">sensitive information</a></h3>
<p>from my understand, We don't need to hidden something. Our thinking,
emotional feeling, thoughts, amount of properties in bank... each of
those should be unified labeled, and ownership protected in its owner
personal chain.</p>
<h3 id=""><a class="header" href="#">......</a></h3>
<h2 id="open-philosophy"><a class="header" href="#open-philosophy">Open philosophy</a></h2>
<p>The best way to protect something is to let everyone knowning what it
is. Open, Open, Open is the core idea of this project, I don't need to
hidden, of course, if I decide that I don't put something into the
chain, and willing to take the risk for lossing it. It's totally my
personal decision, but I courage myself to put all stuff into my chain.</p>
<h2 id="building-a-personal-identification-oriented-databank"><a class="header" href="#building-a-personal-identification-oriented-databank">Building a personal identification oriented Databank</a></h2>
<h2 id="why-and-how-to-avoid-information-loss"><a class="header" href="#why-and-how-to-avoid-information-loss">Why and How to avoid information loss</a></h2>
<h1 id="how-records-will-be-holded"><a class="header" href="#how-records-will-be-holded">How records will be holded</a></h1>
<h1 id="how-records-will-be-propagated"><a class="header" href="#how-records-will-be-propagated">How records will be propagated</a></h1>
<h1 id="how-to-deal-with-its-drawback"><a class="header" href="#how-to-deal-with-its-drawback">How to deal with its drawback</a></h1>
<h1 id="info"><a class="header" href="#info">Info</a></h1>
<h1 id="from-federated-learning-to-decentralized-learning"><a class="header" href="#from-federated-learning-to-decentralized-learning">From Federated Learning to Decentralized Learning</a></h1>

                    </main>

                    <nav class="nav-wrapper" aria-label="Page navigation">
                        <!-- Mobile navigation buttons -->
                            <a rel="prev" href="../md/MasterTheorem.org.html" class="mobile-nav-chapters previous" title="Previous chapter" aria-label="Previous chapter" aria-keyshortcuts="Left">
                                <i class="fa fa-angle-left"></i>
                            </a>

                            <a rel="next prefetch" href="../md/Pandas_merge.org.html" class="mobile-nav-chapters next" title="Next chapter" aria-label="Next chapter" aria-keyshortcuts="Right">
                                <i class="fa fa-angle-right"></i>
                            </a>

                        <div style="clear: both"></div>
                    </nav>
                </div>
            </div>

            <nav class="nav-wide-wrapper" aria-label="Page navigation">
                    <a rel="prev" href="../md/MasterTheorem.org.html" class="nav-chapters previous" title="Previous chapter" aria-label="Previous chapter" aria-keyshortcuts="Left">
                        <i class="fa fa-angle-left"></i>
                    </a>

                    <a rel="next prefetch" href="../md/Pandas_merge.org.html" class="nav-chapters next" title="Next chapter" aria-label="Next chapter" aria-keyshortcuts="Right">
                        <i class="fa fa-angle-right"></i>
                    </a>
            </nav>

        </div>




        <script>
            window.playground_copyable = true;
        </script>


        <script src="../elasticlunr.min.js"></script>
        <script src="../mark.min.js"></script>
        <script src="../searcher.js"></script>

        <script src="../clipboard.min.js"></script>
        <script src="../highlight.js"></script>
        <script src="../book.js"></script>

        <!-- Custom JS scripts -->


    </div>
    </body>
</html>
